// 正序分解整数
// 输入一个非负整数，正序输出它的每一位数字
// 输入 13425
// 输出 1 3 4 2 5
// 输入 700
// 输出 0 0 7

#include <stdio.h>

// 方式一，问题，不能处理 700
int main2() {
  int x;
  scanf("%d", &x);
  int t = 0;

  // 将这个数逆序 52431
  do {
    int d = x%10;
    t = t*10 + d;
    x /= 10;
  } while (x > 0);

  // 将逆序后大数给 x
  x = t;

  // x 倒过来输出 1 3 4 2 5
  do {
    int d = x % 10;
    printf("%d", d);
    if (x > 9) {// 不是个位数
      printf(" ");
    }
    x /= 10;
  } while (x > 0);
  printf("\n");

  return 0;
}

// 方式二，
// 13425 / 10000 -> 1
// 13425 % 10000 -> 3425
// 10000 / 10 -> 1000

// 3425 / 1000 -> 3
// 3425 % 1000 -> 425
// 1000 / 10 -> 100

// 425 / 100 -> 4
// 425 % 100 -> 25
// 100 / 10 -> 10

// 25 / 10 -> 2
// 25 % 10 -> 5
// 10 / 10 -> 1

// 5 / 1 -> 5
// 5 % 1 -> 0
// 1 / 1 -> 0

int main() {
  int x;
  scanf("%d", &x);

  int mask = 1;
  int t = x;
  while (t > 9) {
    t /= 10;
    mask *= 10;
  }

  do {
    int d = x / mask;
    printf("%d", d);
    if (mask > 9) {
      printf(" ");
    }
    x %= mask;
    mask /= 10;
    
  } while (mask > 0);
  
  return 0;
}